{
  "experiences": [
    {
      "company": "Willbox Inc.",
      "position": "Software Engineer",
      "period": "January 2025 - Present",
      "location": "Kanagawa, Japan",
      "description": "Contributed to the renewal development of a logistics SaaS platform, focusing on user interface design and implementation using React (Next.js) and TypeScript. Created comprehensive unit tests with Vitest to ensure code quality. Collaborated closely with product managers to define detailed feature specifications and documentation. Implemented E2E testing environments using Playwright, improving quality assurance. Developed and maintained a reusable UI component library using Storybook for component-driven development (CDD), improving team productivity and UI consistency. Utilized GraphQL + urql for efficient data fetching and caching.",
      "technologies": [
        "nextjs",
        "react",
        "typescript",
        "tailwindcss",
        "storybook",
        "graphql",
        "nodejs",
        "go",
        "docker",
        "git"
      ]
    },
    {
      "company": "Sutrix Solutions Japan",
      "position": "Full Stack Engineer",
      "period": "September 2023 - December 2024",
      "location": "Tokyo, Japan",
      "description": "Worked at a fast-paced digital consulting company specializing in client-driven projects. Contributed to the development of new features for web applications, enhancing functionality to meet client expectations. Built mobile applications using React Native and Single Page Applications with Vue.js. Developed CMS solutions leveraging WordPress, MySQL, PHP, and Docker. Resolved bugs and issues promptly, improving software quality and user experience. Adapted quickly to diverse tech stacks, demonstrating versatility in a dynamic environment. Collaborated with global teams across three different time zones, ensuring efficient project development and successful delivery.",
      "technologies": [
        "react",
        "vuejs",
        "typescript",
        "javascript",
        "php",
        "docker",
        "mysql",
        "css3",
        "git"
      ]
    },
    {
      "company": "Casio México",
      "position": "Sales Planning Executive",
      "period": "August 2022 - December 2022",
      "location": "Mexico City, Mexico",
      "description": "Optimized inventory allocation, driving increased sales and customer satisfaction. Implemented cost-saving purchasing strategies, enhancing supply chain efficiency."
    },
    {
      "company": "Vantec Logistics Mexico, S.A. de C.V.",
      "position": "Assistant Manager",
      "period": "January 2020 - August 2022",
      "location": "Aguascalientes, Mexico",
      "description": "Led all aspects of warehousing, transportation, and project management, ensuring client satisfaction. Analyzed expenses and proposed cost-saving measures, optimizing budget and service quality. Tracked project deliverables and managed working hours, ensuring timely completion and accurate billing."
    }
  ]
}
